artillery.yml
config:
  target: "http://localhost:4000/api/v1"
  phases:
    - duration: 10
      arrivalRate: 5
  payload:
    path: "orders.csv"
    fields:
      - side
      - price
      - quantity
scenarios:
  - name: Place order
    flow:
      - post:
          url: "/symbols/BTCUSDC/orders"
          json:
            side: "{{ side }}"
            price: "{{ price }}"
            quantity: "{{ quantity }}"